app/Controllers/AdminController.php

SELECT *
FROM `faculties`
SELECT *
FROM `departments`
---
    public function dashboard()
    {
        $data['faculties'] = $this->facultyModel->findAll();
        $data['departments'] = $this->departmentModel->findAll();

SELECT *
FROM `faculties`
---
    public function manageFaculty()
    {
        $facultyModel = new FacultyModel();
        $data['faculties'] = $facultyModel->findAll();