app/Controllers/AdminController.php

INSERT INTO `files` (`faculty`, `department`, `filename`, `file_path`) VALUES ('FE', 'Manajemen', 'bg_buku (5) (1) (1) (1) (2).jpg', 'uploads/bg_buku (5) (1) (1) (1) (2).jpg')
---
    public function insertFacultyFiles()
    {
        // Data untuk masing-masing fakultas
        $facultyFiles = [
            ['file_name' => '0069.zip', 'file_type' => 'application/zip', 'file_path' => 'uploads/FE/0069.zip', 'uploaded_at' => date('Y-m-d H:i:s')],
            ['file_name' => '0069.zip', 'file_type' => 'application/zip', 'file_path' => 'uploads/FHISIP/0069.zip', 'uploaded_at' => date('Y-m-d H:i:s')],
            ['file_name' => '0069.zip', 'file_type' => 'application/zip', 'file_path' => 'uploads/FKIP/0069.zip', 'uploaded_at' => date('Y-m-d H:i:s')],
            ['file_name' => '0069.zip', 'file_type' => 'application/zip', 'file_path' => 'uploads/FST/0069.zip', 'uploaded_at' => date('Y-m-d H:i:s')],
            ['file_name' => '0069.zip', 'file_type' => 'application/zip', 'file_path' => 'uploads/PPS/0069.zip', 'uploaded_at' => date('Y-m-d H:i:s')],
        ];

        // Menyisipkan data ke dalam database
        foreach ($facultyFiles as $file) {
            $this->fileModel->insert($file);