app/Controllers/FileManagerController.php

SELECT *
FROM `faculties`
---
     public function index()
    {
        // Membuat instance model
        $facultyModel = new FacultyModel();

        // Mengambil data fakultas dari database
        $data['faculties'] = $facultyModel->findAll();  // Mengambil semua data fakultas

SELECT *
FROM `files`
WHERE `filename` LIKE '%manajemen%' ESCAPE '!'
OR  `faculty` LIKE '%manajemen%' ESCAPE '!'
OR  `department` LIKE '%manajemen%' ESCAPE '!'
---
    public function search()
    {
        $query = $this->request->getGet('query');
        $department = $this->request->getGet('department');
        $faculty = $this->request->getGet('faculty');

        if ($faculty && $department) {
            $results = $this->fileModel->like('filename', $query)
                ->where('faculty', $faculty)
                ->where('department', $department)
                ->findAll();
        } elseif ($faculty) {
            $results = $this->fileModel->like('filename', $query)
                ->where('faculty', $faculty)
                ->findAll();
        } elseif ($department) {
            $results = $this->fileModel->like('filename', $query)
                ->where('department', $department)
                ->findAll();
        } else {
            $results = $this->fileModel->like('filename', $query)
                ->orLike('faculty', $query)
                ->orLike('department', $query)
                ->findAll();

SELECT *
FROM `files`
WHERE `faculty` = 'PAI'
AND `department` = 'dakwah'
SELECT *
FROM `files`
WHERE `faculty` = 'FE'
AND `department` = 'Manajemen'
SELECT *
FROM `departments`
---
    public function faculty($faculty = null, $department = null)
    {
        $files = [];

       if ($faculty && $department) {
            $files = $this->fileModel->where('faculty', $faculty)
                ->where('department', $department)
                ->findAll();
        } elseif ($faculty) {
            $files = $this->fileModel->where('faculty', $faculty)
                ->findAll();
        } elseif ($department) {
            $files = $this->fileModel->where('department', $department)
                ->findAll();
        }


		$jurusanList = $this->departmentModel->findAll();