app/Models/FileModel.php

    public function getUploadedFiles()
    {
        return $this->findAll(); // Mengambil semua data dari tabel
---
SELECT *
FROM `files`